:PROPERTIES:
:ID:       213482ae-a10c-4265-bc03-30df1cfc2521
:END:
#+TITLE: Statistical mechanics of the deep Boltzmann machine
#+AUTHOR:
#+STARTUP: overview hideblocks hidestars indent latexpreview
#+OPTIONS: toc:nil todo:nil ^:{}
#+FILETAGS: notes
#+LATEX_HEADER: \usepackage{tgpagella}
#+LATEX_HEADER: \usepackage{mathpazo}
#+begin_abstract
We model Deep Boltzmann Machines (DBMs) as disordered system of Ising spins on a multi-layered, bipartite lattice. Our aim is to contrast /deep and narrow/ architectures—comprising many layers with fewer nodes each—with /shallow and wide/ architectures that have fewer layers but more nodes in each. The criterion for comparison is the *complexity* which we define as the (normalized) logarithm of the expected number of local minima in the DBM's energy function. This serves as a proxy for the architecture's *representational capacity*. The question we ask is: *Does a deep and narrow architecture (with \(N_1\) total units across \(L_1\) layers) achieve a representational capacity at par or better in comparison to a shallow and wide architecture (with \(N_2\) total units in \(L_2\) layers) so that \(L_1 > L_2\) but \(N_{1} \ll N_{2}\).*
#+end_abstract
* Quenched free energy
:LOGBOOK:
CLOCK: [2023-07-15 Sat 20:08]--[2023-07-16 Sun 01:22] =>  5:14
:END:
We introduce auxiliary variables \((q^{(l)})_{l=0}^{L}\) and  \((m^{(l)})_{l=0}^{L}\) and invoke a HS transform to get

\begin{align*}
\left[\mathcal{Z}^n\right]_{\beta} = &\exp \left( \sum_{l=0}^{L} \dfrac{\widehat{N} \beta^2 J^2 n}{2} \right)\int \prod_{a \neq b} \prod_{l=0}^L \mathcal{D} (q_{ab}^{(l)}) \mathcal{D} (m_{a}^{(l)}) \thinspace
\exp \left(
N \sum_{l=0}^L \alpha_{l} \ln \operatorname{Tr} \exp (\mathcal{L}_{l})
\right) \\
&\quad 
\times \exp \left\{ - N \sum_{l=0}^L \sqrt{\alpha_l \alpha_{l+1}} \left[\frac{\beta^2 J^2}{2} \sum_{a \neq b} q_{a b}^{(l)} q_{a b}^{(l+1)} + \frac{\beta J_0}{2} \sum_a m_a^{(l)} m_a^{(l+1)} \right] \right\},
\end{align*}
where

\begin{align*}
\mathcal{L}_l &\equiv \frac{\beta^2 J^2}{2} \sum_{a \neq b} \bigg( \sum_{\left | k - l  \right | = 1} q_{ab}^{(k)} \bigg) \thinspace \sigma_{l}^a \sigma_{l}^b + \frac{\beta J_0}{2} \sum_a \bigg( \sum_{\left | k - l  \right | = 1} m_a^{(k)} \bigg) \thinspace \sigma_{l}^a,
\end{align*}

The equality is up to a overall \(\mathcal{O} (N^2)\) multiplicative factor on the right hand side whose contribution to the (intensive) free energy vanishes in the thermodynamic limit. The quenched free energy is then obtained via the method of steepest descent

\begin{align*}
- \beta [f] \approx & \max_{\{\boldsymbol{q}, \boldsymbol{m}\}} \bigg\{ \lim_{{n \to 0}} \sum_{{l}} \bigg[ - \frac{\beta^2 J^2}{2n} \sum_{|k - l| = 1} \sqrt{\alpha_l \alpha_{k}} \bigg(\sum_{{a \neq b}} q_{ab}^{(l)} q_{ab}^{(k)} - n \bigg) \\
&\qquad \qquad - \frac{{\beta J_0}}{2n} \sum_{|k - l| = 1} \sqrt{\alpha_l \alpha_{k}} \bigg(\sum_{a} m_{a}^{(l)} m_{a}^{(k)} \bigg) + \frac{{\alpha_l \ln \operatorname{Tr} \exp (\mathcal{L}_{l})}}{n} \bigg] \bigg\},
\end{align*}

the saddle-point equation for the variables \((q^{(l)})_{l=0}^{L}\) and \((m^{(l)})_{l=0}^{L}\) being

\begin{align*}
\gamma_l q_{ab}^{(l+1)} + \nu_{l} q_{ab}^{(l-1)} = \sum_{{\lvert k - l  \rvert = 1}} \langle \sigma_{k}^{a} \sigma_{k}^{b} \rangle_{\mathcal{L}_l},
\end{align*}

\begin{align*}
\gamma_l m_{a}^{(l+1)} + \nu_{l} m_{a}^{(l-1)} = \sum_{{\lvert k - l  \rvert = 1}} \langle \sigma_{k}^{a}\rangle_{\mathcal{L}_l},
\end{align*}

where for arbitrary observable \(\mathcal{O}\) we have defined \(\langle \mathcal{O} \rangle_{\mathcal{L}_l} \equiv (\operatorname{Tr}_{\mathcal{O}}^n \exp \left(\mathcal{L}_l\right))^{-1} \operatorname{Tr}_{\mathcal{O}}^n \mathcal{O} \exp \left(\mathcal{L}_l\right)\).
#+NAME: HS transform
#+begin_steps
Let

\begin{align*}
c_{1}^{\mathrm{T}} \equiv \frac{\beta^2 J^2}{2} \sum_i \sigma_{il}^{a} \sigma_{il}^{b}, 
\quad 
\varphi_{1}^{T} \equiv q_{ab}^{(l+1)}, 
\quad 
c_{2}^{\mathrm{T}} \equiv \frac{\beta^2 J^2}{2} \sum_{j} \sigma_{j (l+1)}^{a} \sigma_{j (l+1)}^{b},
\quad 
\varphi_{2}^{T} \equiv q_{ab}^{(l)},
\end{align*}

\begin{align*}
\quad
A^{-1} \equiv
\begin{pmatrix}
0 & 2 \widehat{N}_l^{-1}(\beta J)^{-2} \\
2 \widehat{N}_l^{-1}(\beta J)^{-2} & 0 \\
\end{pmatrix}
\Rightarrow
A =
\begin{pmatrix}
0 & 2^{-1} \widehat{N}_l \beta^2 J^2\\
2^{-1} \widehat{N}_l \beta^2 J^2 & 0 \\
\end{pmatrix}.
\end{align*}

Let
\begin{align*}
\mathcal{Q} \equiv \exp \left \lbrace \frac{\beta^2 J^2}{2 \widehat{N}_l} \left(\sum_i \sigma_{il}^{a} \sigma_{il}^{b} \right) \left(\sum_{j} \sigma_{j (l+1)}^{a} \sigma_{j (l+1)}^{b} \right)  \right \rbrace = \exp \left(\frac{1}{2} c^{\mathrm{T}} A^{-1} c\right).
\end{align*}

We will now use Theorem A.3 from Appendix A.2 (Wick's theorem for real Bosons) of [cite:@caracciolo2011cayley]. Let \(A=\left(a_{i j}\right)_{i, j=1}^n\) be a real symmetric positive-definite \(n \times n\) matrix. Let \(\varphi=\left(\varphi_i\right)_{i=1}^n\) be real variables. We introduce notation

\begin{align*}
\mathcal{D} (\varphi) =\prod_{i=1}^n \frac{d \varphi_i}{\sqrt{2 \pi}}.
\end{align*}

For any vector \(c=\left(c_i\right)_{i=1}^n\) in \(\mathbb{R}^n\), we have

$$
\int \mathcal{D} \varphi \exp \left(-\frac{1}{2} \varphi^{\mathrm{T}} A \varphi+c^{\mathrm{T}} \varphi\right)=(\operatorname{det} A)^{-1 / 2} \exp \left(\frac{1}{2} c^{\mathrm{T}} A^{-1} c\right).
$$

Using this result

\begin{align*}
&\mathcal{Q} = \frac{\widehat{N}_l \beta^2 J^2}{2}
\int \mathcal{D} ( q_{ab}^{(l)}) \\
&\qquad \times 
\exp \left \lbrace 
- \frac{\beta^2 J^2}{2} \left(
\widehat{N}_l q_{ab}^{(l)} q_{ab}^{(l+1)} -
q_{ab}^{(l)} \sum_i \sigma_{il}^{a} \sigma_{il}^{b} - 
q_{ab}^{(l+1)} \sum_{j} \sigma_{j (l+1)}^{a} \sigma_{j (l+1)}^{b} 
\right)
\right \rbrace
\end{align*}

Likewise, let

\begin{align*}
&\mathcal{M} \equiv \exp \left \lbrace 
\frac{\beta J_0}{\widehat{N}_l} \left( \sum_{i} \sigma_{il}^{a} \right) \left( \sum_{j} \sigma_{j(l+1)}^{b} \right)
\right \rbrace = \exp \left(\frac{1}{2} b^{\mathrm{T}} A^{-1} b\right)
\end{align*}

\begin{align*}
b_{2}^{\mathrm{T}} \equiv \beta J_{0} \sum_i \sigma_{il}^{a} \sigma_{il}^{b}, 
\quad 
\varphi_{1}^{T} \equiv m_{ab}^{(l+1)}, 
\quad 
b_{1}^{\mathrm{T}} \equiv \beta J_{0} \sum_{j} \sigma_{j (l+1)}^{a} \sigma_{j (l+1)}^{b},
\quad 
\varphi_{2}^{T} \equiv m_{ab}^{(l)},
\end{align*}

\begin{align*}
\quad
A^{-1} \equiv
\begin{pmatrix}
2 \widehat{N}_l^{-1}(\beta J_0)^{-1} & 0\\
0 & 2 \widehat{N}_l^{-1}(\beta J_0)^{-1} \\
\end{pmatrix}
\Rightarrow
A =
\begin{pmatrix}
0 & 2^{-1} \widehat{N}_l \beta J_{0} \\
2^{-1} \widehat{N}_l \beta J_{0} & 0\\
\end{pmatrix}.
\end{align*}

On evaluation

\begin{align*}
&\mathcal{M} = \frac{\widehat{N}_l \beta J_0}{2}
\int \mathcal{D} ( m_{a}^{(l)} ) \\
&\qquad \qquad \times \exp \left \lbrace 
- \frac{\beta J_0}{2} \left(
\widehat{N}_l m_{a}^{(l)} m_{a}^{(l+1)}
- m_{a}^{(l+1)} \sum_{i} \sigma_{il}^{a}
- m_{a}^{(l)} \sum_{j} \sigma_{j(l+1)}^{b}
\right)
\right \rbrace
\end{align*}

Combining \(\mathcal{Q}\) and \(\mathcal{M}\) we get the stated result. The \(\left(\det A \right)^{1/2}\) prefactors, being \(\mathcal{O}(N)\) will yield additive constants to the free energy that vanish in the thermodynamic limit. We have dropped them in obtaining

\begin{align*}
\left[\mathcal{Z}^n\right]_\beta & = \exp \left( \sum_{l=0}^{L} \dfrac{\widehat{N} \beta^2 J^2 n}{2}  \right)
\int \prod_{a \neq b} \prod_{l=0} \mathcal{D} (q_{ab}^{(l)}) \mathcal{D} (m_{a}^{(l)}) \\
&\exp \left\{-\sum_{l} \widehat{N}_l\left(\frac{\beta^2 J^2}{2} \sum_{a \neq b} q_{a b}^{(l)} q_{a b}^{(l+1)} +\frac{\beta J_0}{2} \sum_a m_a^{(l)} m_a^{(l+1)} \right)\right\} \\
&\quad \qquad \times \operatorname{Tr} \left[ \exp \left\{ \frac{\beta^2 J^2}{2} \sum_{l} \sum_{a \neq b} q_{a b}^{(l+1)} \sum_i \sigma_{i l}^a \sigma_{i l}^b 
+ \frac{\beta J_0}{2} \sum_{l} \sum_a m_a^{(l+1)} \sum_i \sigma_{i l}^a \right\} \right. \\
&\qquad \qquad \left. \times \exp \left\{\frac{\beta^2 J^2}{2}\sum_{l} \sum_{a \neq b} q_{a b}^{(l)} \sum_j \sigma_{j (l+1)}^a \sigma_{j (l+1)}^b + \frac{\beta J_0}{2}\sum_{l} \sum_a m_a^{(l)} \sum_j \sigma_{j (l+1)}^a \right\} \right].
\end{align*}

Next, we define

\begin{align*}
\mathcal{T} \equiv & \operatorname{Tr} \left[ \exp \left\{ \frac{\beta^2 J^2}{2} \sum_{l} \sum_{a \neq b} q_{a b}^{(l+1)} \sum_i \sigma_{i l}^a \sigma_{i l}^b 
+ \frac{\beta J_0}{2} \sum_{l} \sum_a m_a^{(l+1)} \sum_i \sigma_{i l}^a \right\} \right. \\
&\qquad \qquad \left. \times \exp \left\{\frac{\beta^2 J^2}{2}\sum_{l} \sum_{a \neq b} q_{a b}^{(l)} \sum_j \sigma_{j (l+1)}^a \sigma_{j (l+1)}^b + \frac{\beta J_0}{2}\sum_{l} \sum_a m_a^{(l)} \sum_j \sigma_{j (l+1)}^a \right\} \right],
\end{align*}

and relabel indices \(l+1 \to l \) in the second term (note that \(\sum_{l} \to \sum_{l-1} \equiv \sum_{l}\) because of periodic boundary conditions) we get

\begin{align*}
\mathcal{T} \equiv &\operatorname{Tr} \exp \left\{ \frac{\beta^2 J^2}{2}\sum_{l} \sum_{a \neq b} \left( q_{a b}^{(l+1)} + q_{a b}^{(l-1)} \right) \sum_j \sigma_{j l}^a \sigma_{j l}^b + \frac{\beta J_0}{2}\sum_{l} \sum_a \left(m_a^{(l-1)} + m_a^{(l+1)} \right) \sum_j \sigma_{j l}^a  \right\}
\end{align*}

The sum over the layers and the sum over the replicas factorizes over the spins, i.e., the site index of the spin has no bearing on its participation in sums over the layers or the replicas. Therefore, we do away with the site indices for the spins \(\sigma_{il}^{a} \to \sigma_{l}^{a}\), redefine \(\operatorname{Tr}\) to mean \(\sum_{\sigma^{a}}\) henceforth, and write

\begin{align*}
& \mathcal{T} =
\prod_{l} \left[
\operatorname{Tr} \exp \left\{ \frac{\beta^2 J^2}{2} \sum_{a \neq b} \left( \sum_{\left \lvert k - l  \right \rvert = 1} q_{ab}^{(k)} \right) \sigma_{l}^a \sigma_{l}^b 
+ \frac{\beta J_0}{2} \sum_a \left( \sum_{\left \lvert k - l  \right \rvert = 1} m_{a}^{(k)} \right) \sigma_{l}^a \right\}
\right]^{N_{l}}.
\end{align*}

With

\begin{align*}
\mathcal{L}_l \equiv \frac{\beta^2 J^2}{2} \sum_{a \neq b} \left( \sum_{\left \lvert k - l  \right \rvert = 1} q_{ab}^{(k)} \right) \sigma_{l}^a \sigma_{l}^b 
+ \frac{\beta J_0}{2} \sum_a \left( \sum_{\left \lvert k - l  \right \rvert = 1} m_{a}^{(k)} \right) \sigma_{l}^a,
\end{align*}

we finally have

\begin{align*}
\mathcal{T} = \exp \left(N \sum_{l=0}^L \alpha_{l} \ln \operatorname{Tr} \exp (\mathcal{L}_{l}) \right).
\end{align*}

In the final step we have used \(x \equiv \exp (\ln x)\) for \(x > 0\). Substituting in the expression for \(\left[\mathcal{Z}^n\right]_\beta\) we get the stated result.
#+end_steps
#+NAME: Quenched free energy
#+begin_steps
In the thermodynamic limit \(N \to \infty\), we can approximate \(\left[\mathcal{Z}^n\right]_\beta\) using the method of steepest descent

\begin{align*}
&\left[\mathcal{Z}^n\right]_{\beta} \approx \\
&\quad
\exp \left( - N \sum_{l=0}^L \sqrt{\alpha_l \alpha_{l+1}} \left[\frac{\beta^2 J^2}{2} \sum_{a \neq b} q_{a b}^{(l)} q_{a b}^{(l+1)} + \frac{\beta J_0}{2} \sum_a m_a^{(l)} m_a^{(l+1)} - \frac{\beta^2 J^2 n}{2} - \frac{\ln \operatorname{Tr} \exp (\mathcal{L}_{l})}{\gamma_l} \right] \right) \\
\end{align*}

Expanding in Taylor series in \(nN\) in the limit \(n \to 0\) and \(N\) large but finite and invoking \(\ln x = \lim_{n \to 0}n^{-1} (x^n - 1)\) we get the stated result.
#+end_steps
* The energy landscape of DBM
We can place bounds on the Hamiltonian

\begin{align*}
- J_0 \sum_{l=0}^{L} \sqrt{N_l N_{l+1}} - k J \left( \sum_{l=0}^{L} \sqrt{N_l N_{l+1}} \right)^{1/2} 
\leq H \leq
J_0 \sum_{l=0}^{L} \sqrt{N_l N_{l+1}} + k J \left( \sum_{l=0}^{L} \sqrt{N_l N_{l+1}} \right)^{1/2}
\end{align*}

#+NAME: Bounds on the DBM Hamiltonian
#+begin_src python :results output
  import numpy as np
  def calculate_bounds(J_0, J, N, k=10):
      L = len(N)
      sum_of_gmeans = sum(np.sqrt(N[l] * (N[(l+1) % L])) for l in range(L))
      # Calculate the lower bound
      lower_bound = -J_0 * sum_of_gmeans - k * J * np.sqrt(sum_of_gmeans)

      # Calculate the upper bound
      upper_bound = J_0 * sum_of_gmeans + k * J * np.sqrt(sum_of_gmeans)
      return lower_bound, upper_bound

  bounds = calculate_bounds(0.0, 1.0, [200, 200], k=10)
  print(bounds)
#+end_src

Next, we will /assume a fixed inter-layer ratio \(\gamma\)/, i.e.,  \(N_l = \lfloor N_0 \gamma^{2l} \rfloor\). If \(L\) is allowed to vary but \(N\) and \(N_0\) are fixed, such a network can always be constructed for \(\gamma > 1\). For \(\gamma < 1\), a construction is only possible for a /sufficiently slow/ shrinking:

\begin{align*}
\alpha_{0} \gtrapprox 1-\gamma^2
\end{align*}

#+NAME: Realizable network for γ < 1
#+begin_steps
We make the approximation \(N_l = \lfloor N_0 \gamma^{2l} \rfloor \approx N_0 \gamma^{2l}\). The condition for a realizable construction is

\begin{align*}
\sum_{l=0}^{L} N_0 \gamma^{2l} = N_0 \left( \frac{1-\gamma^{2(L+1)}}{1-\gamma^2} \right) \geq N
\end{align*}

On solving for \(L\)

\[
1 + L = \frac{\ln\left(1 - [1 - \gamma^2] N/N_0\right)}{\ln(\gamma^2)}.
\]

We will need

\begin{align*}
1 - (1 - \gamma^2) \frac{N}{N_0} > 0
\end{align*}

which simplifies to

\begin{align*}
\alpha_{0} > 1-\gamma^2.
\end{align*}

On restoring \(\approx\) (to indicate the approximate nature of the inequality) under the \(>\) sign yields the stated result.
#+end_steps

For our experiments, we will fix \(N_0 = 1025\). We will also "fix" \(N \equiv N_{\mathrm{tot}} = 2000\) in the sense the errors introduced by treating \(N_l\) as real-numbers instead of integers will result in \(\sum_l N_l > N_{\mathrm{tot}}\). Furthermore, the error \(\Delta N \equiv \sum_l N_l - N_{\mathrm{tot}} > 0\) is is positive and an increasing function of \(\gamma\). Since we are interested in the answering whether /lean/ networks have at par or better /representational capacity/ than /fat/ ones, we will view this slippage of control favorably because it only makes an affirmative to our question bolder - /lean/ networks have at par or better /representational capacity/ than /fat/ ones with lesser number of units. \(\gamma\) will take values from \(0.5\) to \(1.5\) in increments of \(0.1\). We will study the cases \((J_0,J) = (0.0,1.0)\),  \((J_0,J) = (1.0,1.0)\) and  \((J_0,J) = (1.0,5.0)\). Leniently, we set \(k=10\) in determining the bounds for the Hamiltonian - the probability of encountering a value outside this range is one in a hundred. The \(11\) DBM architectures and the associated bounds on \(H\) are:

#+NAME: Experiment schedule (J₀,J) = (1,5)
|  γ² |   N₀ |    N | {Nₗ}                               |    Hₘᵢₙ |   Hₘₐₓ |
|-----+------+------+------------------------------------+---------+--------|
| 0.5 | 1025 | 2041 | 1025, 512, 256, 128, 64, 32, 16, 8 | -390.86 | 390.86 |
| 0.6 | 1025 | 2009 | 1025, 615, 369                     |  -434.2 |  434.2 |
| 0.7 | 1025 | 2243 | 1025, 717, 501                     | -466.18 | 466.18 |
| 0.8 | 1025 | 2499 | 1025, 819, 655                     | -496.79 | 496.79 |
| 0.9 | 1025 | 2776 | 1025, 922, 829                     | -526.14 | 526.14 |
| 1.0 | 1025 | 2050 | 1025, 1025                         | -452.77 | 452.77 |
| 1.1 | 1025 | 2152 | 1025, 1127                         | -463.64 | 463.64 |
| 1.2 | 1025 | 2254 | 1025, 1229                         | -473.79 | 473.79 |
| 1.3 | 1025 | 2357 | 1025, 1332                         | -483.42 | 483.42 |
| 1.4 | 1025 | 2460 | 1025, 1435                         |  -492.5 |  492.5 |
| 1.5 | 1025 | 2562 | 1025, 1537                         | -501.03 | 501.03 |

#+NAME: Experiment schedule (J₀,J) = (1,1)
|  γ² |   N₀ |    N | {Nₗ}                               |     Hₘᵢₙ |    Hₘₐₓ |
|-----+------+------+------------------------------------+----------+---------|
| 0.5 | 1025 | 2041 | 1025, 512, 256, 128, 64, 32, 16, 8 | -1918.61 | 1918.61 |
| 0.6 | 1025 | 2009 | 1025, 615, 369                     | -2319.54 | 2319.54 |
| 0.7 | 1025 | 2243 | 1025, 717, 501                     | -2639.41 | 2639.41 |
| 0.8 | 1025 | 2499 | 1025, 819, 655                     | -2964.82 | 2964.82 |
| 0.9 | 1025 | 2776 | 1025, 922, 829                     | -3294.34 | 3294.34 |
| 1.0 | 1025 | 2050 | 1025, 1025                         | -2502.77 | 2502.77 |
| 1.1 | 1025 | 2152 | 1025, 1127                         | -2613.22 | 2613.22 |
| 1.2 | 1025 | 2254 | 1025, 1229                         | -2718.54 | 2718.54 |
| 1.3 | 1025 | 2357 | 1025, 1332                         | -2820.34 | 2820.34 |
| 1.4 | 1025 | 2460 | 1025, 1435                         |  -2918.1 |  2918.1 |
| 1.5 | 1025 | 2562 | 1025, 1537                         | -3011.35 | 3011.35 |

#+NAME: Experiment schedule (J₀,J) = (1,5)
|  γ² |   N₀ |    N | {Nₗ}                               |     Hₘᵢₙ |    Hₘₐₓ |
|-----+------+------+------------------------------------+----------+---------|
| 0.5 | 1025 | 2041 | 1025, 512, 256, 128, 64, 32, 16, 8 | -3482.07 | 3482.07 |
| 0.6 | 1025 | 2009 | 1025, 615, 369                     | -4056.36 | 4056.36 |
| 0.7 | 1025 | 2243 | 1025, 717, 501                     | -4504.13 | 4504.13 |
| 0.8 | 1025 | 2499 | 1025, 819, 655                     | -4951.99 | 4951.99 |
| 0.9 | 1025 | 2776 | 1025, 922, 829                     | -5398.89 | 5398.89 |
| 1.0 | 1025 | 2050 | 1025, 1025                         | -4313.85 | 4313.85 |
| 1.1 | 1025 | 2152 | 1025, 1127                         | -4467.76 | 4467.76 |
| 1.2 | 1025 | 2254 | 1025, 1229                         | -4613.69 | 4613.69 |
| 1.3 | 1025 | 2357 | 1025, 1332                         | -4754.01 | 4754.01 |
| 1.4 | 1025 | 2460 | 1025, 1435                         | -4888.11 | 4888.11 |
| 1.5 | 1025 | 2562 | 1025, 1537                         | -5015.47 | 5015.47 |

#+begin_src python :results output
  import math
  import numpy as np

  def calculate_bounds(J_0, J, N, k=10):
      L = len(N)
      sum_of_gmeans = sum(np.sqrt(N[l] * (N[(l+1) % L])) for l in range(L))
      # Calculate the lower bound
      lower_bound = -J_0 * sum_of_gmeans - k * J * np.sqrt(sum_of_gmeans)

      # Calculate the upper bound
      upper_bound = J_0 * sum_of_gmeans + k * J * np.sqrt(sum_of_gmeans)
      return lower_bound, upper_bound

  def L(gamma, N0, N):
      return (math.log(1 - (1 - gamma ** 2) * (N / N0)) / math.log(gamma)) - 1

  gammas = np.sqrt([0.5, 0.6, 0.7, 0.8, 0.9, 1.00001, 1.1, 1.2, 1.3, 1.4, 1.5])
  N_tot = 2000.0
  num_visible = 1025.0
  for gamma in gammas:
      layers = L(gamma, num_visible, N_tot)
      layers = int(np.floor(layers))
      N = [num_visible]
      for i in range(layers-1):
          spins = np.floor((gamma**2) * N[i])
          N.append(spins)
      N = np.array(N)
      total = np.sum(N)
      if total > N_tot:
          if np.sum(N[:-1]) > N_tot:
              N = N[:-1]
      bounds = np.around(calculate_bounds(0.0, 1.0, N), 2)
      print(f"\n-------γ²={np.around(gamma**2,2)}, N = {sum(N)}---------")
      print(f"\n{bounds[0]} < H < {bounds[1]}")
      print(f"\n{[int(N_l) for N_l in N]}")
#+end_src

#+RESULTS:
#+begin_example

-------γ²=0.5, N = 2041.0---------

-390.86 < H < 390.86

[1025, 512, 256, 128, 64, 32, 16, 8]

-------γ²=0.6, N = 2009.0---------

-434.2 < H < 434.2

[1025, 615, 369]

-------γ²=0.7, N = 2243.0---------

-466.18 < H < 466.18

[1025, 717, 501]

-------γ²=0.8, N = 2499.0---------

-496.79 < H < 496.79

[1025, 819, 655]

-------γ²=0.9, N = 2776.0---------

-526.14 < H < 526.14

[1025, 922, 829]

-------γ²=1.0, N = 2050.0---------

-452.77 < H < 452.77

[1025, 1025]

-------γ²=1.1, N = 2152.0---------

-463.64 < H < 463.64

[1025, 1127]

-------γ²=1.2, N = 2254.0---------

-473.79 < H < 473.79

[1025, 1229]

-------γ²=1.3, N = 2357.0---------

-483.42 < H < 483.42

[1025, 1332]

-------γ²=1.4, N = 2460.0---------

-492.5 < H < 492.5

[1025, 1435]

-------γ²=1.5, N = 2562.0---------

-501.03 < H < 501.03

[1025, 1537]
#+end_example
